src/test/jmeter/jmeter.log
2022-03-04 14:05:01,837 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2022-03-04 14:05:01,857 INFO o.a.j.JMeter: Loading user properties from: /opt/apache-jmeter-5.4.3/bin/user.properties
2022-03-04 14:05:01,857 INFO o.a.j.JMeter: Loading system properties from: /opt/apache-jmeter-5.4.3/bin/system.properties
2022-03-04 14:05:01,857 INFO o.a.j.JMeter: Setting JMeter property: host=20.82.54.19
2022-03-04 14:05:01,864 INFO o.a.j.JMeter: Copyright (c) 1998-2021 The Apache Software Foundation
2022-03-04 14:05:01,864 INFO o.a.j.JMeter: Version 5.4.3
2022-03-04 14:05:01,864 INFO o.a.j.JMeter: java.version=11.0.13
2022-03-04 14:05:01,864 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2022-03-04 14:05:01,864 INFO o.a.j.JMeter: os.name=Linux
2022-03-04 14:05:01,864 INFO o.a.j.JMeter: os.arch=amd64
2022-03-04 14:05:01,865 INFO o.a.j.JMeter: os.version=5.13.0-30-generic
2022-03-04 14:05:01,865 INFO o.a.j.JMeter: file.encoding=UTF-8
2022-03-04 14:05:01,865 INFO o.a.j.JMeter: java.awt.headless=true
2022-03-04 14:05:01,865 INFO o.a.j.JMeter: Max memory     =1073741824
2022-03-04 14:05:01,865 INFO o.a.j.JMeter: Available Processors =8
2022-03-04 14:05:01,873 INFO o.a.j.JMeter: Default Locale=English (EN)
2022-03-04 14:05:01,873 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2022-03-04 14:05:01,874 INFO o.a.j.JMeter: JMeterHome=/opt/apache-jmeter-5.4.3
2022-03-04 14:05:01,874 INFO o.a.j.JMeter: user.dir  =/home/robin/Documents/projects/devoteam-traineeship-petclinic/src/test/jmeter
2022-03-04 14:05:01,874 INFO o.a.j.JMeter: PWD       =/home/robin/Documents/projects/devoteam-traineeship-petclinic/src/test/jmeter
2022-03-04 14:05:01,874 INFO o.a.j.JMeter: IP: 127.0.1.1 Name: robin-HP-EliteBook-850-G6 FullName: robin-HP-EliteBook-850-G6
2022-03-04 14:05:01,878 INFO o.a.j.s.FileServer: Default base='/home/robin/Documents/projects/devoteam-traineeship-petclinic/src/test/jmeter'
2022-03-04 14:05:01,878 INFO o.a.j.s.FileServer: Set new base='/home/robin/Documents/projects/devoteam-traineeship-petclinic/src/test/jmeter'
2022-03-04 14:05:01,989 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2022-03-04 14:05:02,003 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2022-03-04 14:05:02,005 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2022-03-04 14:05:02,007 INFO o.a.j.s.SaveService: Loading file: petclinic_test_plan.jmx
2022-03-04 14:05:02,033 INFO o.a.j.p.h.c.CookieManager: Settings: Delete null: true Check: true Allow variable: true Save: false Prefix: COOKIE_
2022-03-04 14:05:02,042 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2022-03-04 14:05:02,042 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2022-03-04 14:05:02,042 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2022-03-04 14:05:02,042 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2022-03-04 14:05:02,042 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2022-03-04 14:05:02,042 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2022-03-04 14:05:02,067 INFO o.a.j.JMeter: Creating summariser <summary>
2022-03-04 14:05:02,069 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2022-03-04 14:05:02,070 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2022-03-04 14:05:02,070 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2022-03-04 14:05:02,075 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2022-03-04 14:05:02,075 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2022-03-04 14:05:02,286 INFO o.a.j.JMeter: Running test (1646399102286)
2022-03-04 14:05:02,326 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : User threads
2022-03-04 14:05:02,326 INFO o.a.j.e.StandardJMeterEngine: Starting 10 threads for group User threads.
2022-03-04 14:05:02,326 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2022-03-04 14:05:02,327 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=10 ramp-up=10 delayedStart=true
2022-03-04 14:05:02,327 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2022-03-04 14:05:02,328 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2022-03-04 14:05:02,339 INFO o.a.j.t.JMeterThread: Thread started: User threads 1-1
2022-03-04 14:05:02,687 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = robin-HP-EliteBook-850-G6
2022-03-04 14:05:02,693 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2022-03-04 14:05:02,695 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2022-03-04 14:05:02,695 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2022-03-04 14:05:02,696 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2022-03-04 14:05:02,696 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2022-03-04 14:05:02,792 INFO o.a.j.r.Summariser: summary +      1 in 00:00:01 =    2.0/s Avg:    53 Min:    53 Max:    53 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2022-03-04 14:05:03,452 INFO o.a.j.t.JMeterThread: Thread started: User threads 1-2
2022-03-04 14:05:04,567 INFO o.a.j.t.JMeterThread: Thread started: User threads 1-3
2022-03-04 14:05:05,681 INFO o.a.j.t.JMeterThread: Thread started: User threads 1-4
2022-03-04 14:05:06,789 INFO o.a.j.t.JMeterThread: Thread started: User threads 1-5
2022-03-04 14:05:07,901 INFO o.a.j.t.JMeterThread: Thread started: User threads 1-6
2022-03-04 14:05:08,828 INFO o.a.j.t.JMeterThread: Thread is done: User threads 1-2
2022-03-04 14:05:08,829 INFO o.a.j.t.JMeterThread: Thread finished: User threads 1-2
2022-03-04 14:05:09,011 INFO o.a.j.t.JMeterThread: Thread started: User threads 1-7
2022-03-04 14:05:10,120 INFO o.a.j.t.JMeterThread: Thread started: User threads 1-8
2022-03-04 14:05:10,473 INFO o.a.j.t.JMeterThread: Thread is done: User threads 1-1
2022-03-04 14:05:10,473 INFO o.a.j.t.JMeterThread: Thread finished: User threads 1-1
2022-03-04 14:05:10,490 INFO o.a.j.t.JMeterThread: Thread is done: User threads 1-4
2022-03-04 14:05:10,490 INFO o.a.j.t.JMeterThread: Thread finished: User threads 1-4
2022-03-04 14:05:10,499 INFO o.a.j.t.JMeterThread: Thread is done: User threads 1-3
2022-03-04 14:05:10,499 INFO o.a.j.t.JMeterThread: Thread finished: User threads 1-3
2022-03-04 14:05:10,713 INFO o.a.j.t.JMeterThread: Thread is done: User threads 1-5
2022-03-04 14:05:10,714 INFO o.a.j.t.JMeterThread: Thread finished: User threads 1-5
2022-03-04 14:05:11,227 INFO o.a.j.t.JMeterThread: Thread started: User threads 1-9
2022-03-04 14:05:12,203 INFO o.a.j.t.JMeterThread: Thread is done: User threads 1-6
2022-03-04 14:05:12,203 INFO o.a.j.t.JMeterThread: Thread finished: User threads 1-6
2022-03-04 14:05:12,333 INFO o.a.j.t.JMeterThread: Thread started: User threads 1-10
2022-03-04 14:05:12,978 INFO o.a.j.t.JMeterThread: Thread is done: User threads 1-7
2022-03-04 14:05:12,979 INFO o.a.j.t.JMeterThread: Thread finished: User threads 1-7
2022-03-04 14:05:14,031 INFO o.a.j.t.JMeterThread: Thread is done: User threads 1-8
2022-03-04 14:05:14,032 INFO o.a.j.t.JMeterThread: Thread finished: User threads 1-8
2022-03-04 14:05:15,102 INFO o.a.j.t.JMeterThread: Thread is done: User threads 1-9
2022-03-04 14:05:15,103 INFO o.a.j.t.JMeterThread: Thread finished: User threads 1-9
2022-03-04 14:05:16,195 INFO o.a.j.t.JMeterThread: Thread is done: User threads 1-10
2022-03-04 14:05:16,196 INFO o.a.j.t.JMeterThread: Thread finished: User threads 1-10
2022-03-04 14:05:16,197 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2022-03-04 14:05:16,199 INFO o.a.j.r.Summariser: summary +    119 in 00:00:13 =    8.9/s Avg:    98 Min:    12 Max:  1008 Err:     0 (0.00%) Active: 0 Started: 10 Finished: 10
2022-03-04 14:05:16,200 INFO o.a.j.r.Summariser: summary =    120 in 00:00:14 =    8.6/s Avg:    98 Min:    12 Max:  1008 Err:     0 (0.00%)