src/test/jmeter/jmeter.log
2022-02-11 11:22:43,021 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2022-02-11 11:22:43,037 INFO o.a.j.JMeter: Loading user properties from: /opt/apache-jmeter-5.4.3/bin/user.properties
2022-02-11 11:22:43,037 INFO o.a.j.JMeter: Loading system properties from: /opt/apache-jmeter-5.4.3/bin/system.properties
2022-02-11 11:22:43,037 INFO o.a.j.JMeter: Setting JMeter property: host=52.179.97.143
2022-02-11 11:22:43,042 INFO o.a.j.JMeter: Copyright (c) 1998-2021 The Apache Software Foundation
2022-02-11 11:22:43,042 INFO o.a.j.JMeter: Version 5.4.3
2022-02-11 11:22:43,042 INFO o.a.j.JMeter: java.version=11.0.13
2022-02-11 11:22:43,042 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2022-02-11 11:22:43,042 INFO o.a.j.JMeter: os.name=Linux
2022-02-11 11:22:43,042 INFO o.a.j.JMeter: os.arch=amd64
2022-02-11 11:22:43,042 INFO o.a.j.JMeter: os.version=5.13.0-28-generic
2022-02-11 11:22:43,042 INFO o.a.j.JMeter: file.encoding=UTF-8
2022-02-11 11:22:43,042 INFO o.a.j.JMeter: java.awt.headless=true
2022-02-11 11:22:43,043 INFO o.a.j.JMeter: Max memory     =1073741824
2022-02-11 11:22:43,043 INFO o.a.j.JMeter: Available Processors =8
2022-02-11 11:22:43,048 INFO o.a.j.JMeter: Default Locale=English (EN)
2022-02-11 11:22:43,048 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2022-02-11 11:22:43,049 INFO o.a.j.JMeter: JMeterHome=/opt/apache-jmeter-5.4.3
2022-02-11 11:22:43,049 INFO o.a.j.JMeter: user.dir  =/home/robin/Documents/projects/devoteam-traineeship-petclinic/src/test/jmeter
2022-02-11 11:22:43,049 INFO o.a.j.JMeter: PWD       =/home/robin/Documents/projects/devoteam-traineeship-petclinic/src/test/jmeter
2022-02-11 11:22:43,049 INFO o.a.j.JMeter: IP: 127.0.1.1 Name: robin-HP-EliteBook-850-G6 FullName: robin-HP-EliteBook-850-G6
2022-02-11 11:22:43,052 INFO o.a.j.s.FileServer: Default base='/home/robin/Documents/projects/devoteam-traineeship-petclinic/src/test/jmeter'
2022-02-11 11:22:43,053 INFO o.a.j.s.FileServer: Set new base='/home/robin/Documents/projects/devoteam-traineeship-petclinic/src/test/jmeter'
2022-02-11 11:22:43,160 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2022-02-11 11:22:43,174 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2022-02-11 11:22:43,177 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2022-02-11 11:22:43,180 INFO o.a.j.s.SaveService: Loading file: petclinic_test_plan.jmx
2022-02-11 11:22:43,207 INFO o.a.j.p.h.c.CookieManager: Settings: Delete null: true Check: true Allow variable: true Save: false Prefix: COOKIE_
2022-02-11 11:22:43,218 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2022-02-11 11:22:43,218 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2022-02-11 11:22:43,218 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2022-02-11 11:22:43,218 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2022-02-11 11:22:43,218 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2022-02-11 11:22:43,218 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2022-02-11 11:22:43,243 INFO o.a.j.JMeter: Creating summariser <summary>
2022-02-11 11:22:43,246 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2022-02-11 11:22:43,246 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2022-02-11 11:22:43,246 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2022-02-11 11:22:43,251 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2022-02-11 11:22:43,252 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2022-02-11 11:22:43,514 INFO o.a.j.JMeter: Running test (1644574963514)
2022-02-11 11:22:43,533 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : User threads
2022-02-11 11:22:43,533 INFO o.a.j.e.StandardJMeterEngine: Starting 10 threads for group User threads.
2022-02-11 11:22:43,534 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2022-02-11 11:22:43,534 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=10 ramp-up=10 delayedStart=true
2022-02-11 11:22:43,534 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2022-02-11 11:22:43,534 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2022-02-11 11:22:43,543 INFO o.a.j.t.JMeterThread: Thread started: User threads 1-1
2022-02-11 11:22:43,883 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = robin-HP-EliteBook-850-G6
2022-02-11 11:22:43,889 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2022-02-11 11:22:43,891 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2022-02-11 11:22:43,891 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2022-02-11 11:22:43,891 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2022-02-11 11:22:43,891 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2022-02-11 11:22:44,657 INFO o.a.j.t.JMeterThread: Thread started: User threads 1-2
2022-02-11 11:22:45,768 INFO o.a.j.t.JMeterThread: Thread started: User threads 1-3
2022-02-11 11:22:46,884 INFO o.a.j.t.JMeterThread: Thread started: User threads 1-4
2022-02-11 11:22:47,992 INFO o.a.j.t.JMeterThread: Thread started: User threads 1-5
2022-02-11 11:22:49,101 INFO o.a.j.t.JMeterThread: Thread started: User threads 1-6
2022-02-11 11:22:49,234 INFO o.a.j.t.JMeterThread: Thread is done: User threads 1-1
2022-02-11 11:22:49,234 INFO o.a.j.t.JMeterThread: Thread finished: User threads 1-1
2022-02-11 11:22:50,210 INFO o.a.j.t.JMeterThread: Thread started: User threads 1-7
2022-02-11 11:22:50,463 INFO o.a.j.t.JMeterThread: Thread is done: User threads 1-2
2022-02-11 11:22:50,463 INFO o.a.j.t.JMeterThread: Thread finished: User threads 1-2
2022-02-11 11:22:51,321 INFO o.a.j.t.JMeterThread: Thread started: User threads 1-8
2022-02-11 11:22:51,590 INFO o.a.j.t.JMeterThread: Thread is done: User threads 1-3
2022-02-11 11:22:51,590 INFO o.a.j.t.JMeterThread: Thread finished: User threads 1-3
2022-02-11 11:22:52,431 INFO o.a.j.t.JMeterThread: Thread started: User threads 1-9
2022-02-11 11:22:52,555 INFO o.a.j.t.JMeterThread: Thread is done: User threads 1-4
2022-02-11 11:22:52,556 INFO o.a.j.t.JMeterThread: Thread finished: User threads 1-4
2022-02-11 11:22:53,536 INFO o.a.j.t.JMeterThread: Thread started: User threads 1-10
2022-02-11 11:22:53,691 INFO o.a.j.t.JMeterThread: Thread is done: User threads 1-5
2022-02-11 11:22:53,691 INFO o.a.j.t.JMeterThread: Thread finished: User threads 1-5
2022-02-11 11:22:54,774 INFO o.a.j.t.JMeterThread: Thread is done: User threads 1-6
2022-02-11 11:22:54,774 INFO o.a.j.t.JMeterThread: Thread finished: User threads 1-6
2022-02-11 11:22:55,786 INFO o.a.j.t.JMeterThread: Thread is done: User threads 1-7
2022-02-11 11:22:55,786 INFO o.a.j.t.JMeterThread: Thread finished: User threads 1-7
2022-02-11 11:22:56,699 INFO o.a.j.t.JMeterThread: Thread is done: User threads 1-8
2022-02-11 11:22:56,700 INFO o.a.j.t.JMeterThread: Thread finished: User threads 1-8
2022-02-11 11:22:57,821 INFO o.a.j.t.JMeterThread: Thread is done: User threads 1-9
2022-02-11 11:22:57,821 INFO o.a.j.t.JMeterThread: Thread finished: User threads 1-9
2022-02-11 11:22:58,961 INFO o.a.j.t.JMeterThread: Thread is done: User threads 1-10
2022-02-11 11:22:58,962 INFO o.a.j.t.JMeterThread: Thread finished: User threads 1-10
2022-02-11 11:22:58,963 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2022-02-11 11:22:58,966 INFO o.a.j.r.Summariser: summary =    120 in 00:00:15 =    7.8/s Avg:   165 Min:    89 Max:   621 Err:     0 (0.00%)