src/test/jmeter/jmeter.log
2022-03-04 12:55:19,415 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2022-03-04 12:55:19,431 INFO o.a.j.JMeter: Loading user properties from: /opt/apache-jmeter-5.4.3/bin/user.properties
2022-03-04 12:55:19,431 INFO o.a.j.JMeter: Loading system properties from: /opt/apache-jmeter-5.4.3/bin/system.properties
2022-03-04 12:55:19,431 INFO o.a.j.JMeter: Setting JMeter property: host=20.82.54.19
2022-03-04 12:55:19,435 INFO o.a.j.JMeter: Copyright (c) 1998-2021 The Apache Software Foundation
2022-03-04 12:55:19,436 INFO o.a.j.JMeter: Version 5.4.3
2022-03-04 12:55:19,436 INFO o.a.j.JMeter: java.version=11.0.13
2022-03-04 12:55:19,436 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2022-03-04 12:55:19,436 INFO o.a.j.JMeter: os.name=Linux
2022-03-04 12:55:19,436 INFO o.a.j.JMeter: os.arch=amd64
2022-03-04 12:55:19,436 INFO o.a.j.JMeter: os.version=5.13.0-30-generic
2022-03-04 12:55:19,436 INFO o.a.j.JMeter: file.encoding=UTF-8
2022-03-04 12:55:19,436 INFO o.a.j.JMeter: java.awt.headless=true
2022-03-04 12:55:19,436 INFO o.a.j.JMeter: Max memory     =1073741824
2022-03-04 12:55:19,436 INFO o.a.j.JMeter: Available Processors =8
2022-03-04 12:55:19,441 INFO o.a.j.JMeter: Default Locale=English (EN)
2022-03-04 12:55:19,442 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2022-03-04 12:55:19,442 INFO o.a.j.JMeter: JMeterHome=/opt/apache-jmeter-5.4.3
2022-03-04 12:55:19,442 INFO o.a.j.JMeter: user.dir  =/home/robin/Documents/projects/devoteam-traineeship-petclinic/src/test/jmeter
2022-03-04 12:55:19,442 INFO o.a.j.JMeter: PWD       =/home/robin/Documents/projects/devoteam-traineeship-petclinic/src/test/jmeter
2022-03-04 12:55:19,442 INFO o.a.j.JMeter: IP: 127.0.1.1 Name: robin-HP-EliteBook-850-G6 FullName: robin-HP-EliteBook-850-G6
2022-03-04 12:55:19,445 INFO o.a.j.s.FileServer: Default base='/home/robin/Documents/projects/devoteam-traineeship-petclinic/src/test/jmeter'
2022-03-04 12:55:19,446 INFO o.a.j.s.FileServer: Set new base='/home/robin/Documents/projects/devoteam-traineeship-petclinic/src/test/jmeter'
2022-03-04 12:55:19,551 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2022-03-04 12:55:19,564 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2022-03-04 12:55:19,567 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2022-03-04 12:55:19,571 INFO o.a.j.s.SaveService: Loading file: petclinic_blazemeter_demo2.jmx
2022-03-04 12:55:19,600 INFO o.a.j.p.h.c.CookieManager: Settings: Delete null: true Check: true Allow variable: true Save: false Prefix: COOKIE_
2022-03-04 12:55:19,602 INFO o.a.j.p.h.c.CacheManager: Will only cache the following methods: [GET]
2022-03-04 12:55:19,614 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2022-03-04 12:55:19,614 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2022-03-04 12:55:19,615 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2022-03-04 12:55:19,615 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2022-03-04 12:55:19,615 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2022-03-04 12:55:19,615 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2022-03-04 12:55:19,649 INFO o.a.j.JMeter: Creating summariser <summary>
2022-03-04 12:55:19,653 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2022-03-04 12:55:19,655 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2022-03-04 12:55:19,655 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2022-03-04 12:55:19,660 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2022-03-04 12:55:19,660 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2022-03-04 12:55:19,889 INFO o.a.j.JMeter: Running test (1646394919889)
2022-03-04 12:55:19,908 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Thread Group
2022-03-04 12:55:19,909 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group Thread Group.
2022-03-04 12:55:19,909 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2022-03-04 12:55:19,909 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 delayedStart=false
2022-03-04 12:55:19,917 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2022-03-04 12:55:19,917 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2022-03-04 12:55:19,922 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2022-03-04 12:55:19,923 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2022-03-04 12:55:19,923 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2022-03-04 12:55:19,923 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2022-03-04 12:55:19,924 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-1
2022-03-04 12:55:19,937 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = robin-HP-EliteBook-850-G6
2022-03-04 12:55:19,941 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2022-03-04 12:57:30,237 INFO o.a.j.r.Summariser: summary +      1 in 00:02:10 =    0.0/s Avg: 130251 Min: 130251 Max: 130251 Err:     1 (100.00%) Active: 1 Started: 1 Finished: 0
2022-03-04 13:04:56,166 INFO o.a.j.r.ResultCollector: Shutdown hook started
2022-03-04 13:04:56,171 INFO o.a.j.r.ResultCollector: Shutdown hook ended